"use client";
import React, { useState } from "react";
import ExpandableDiv from "./utils/expandable-div";

interface Item {
  title: string;
  content: string;
}

export const Services: React.FC = () => {
  const [openIndex, setOpenIndex] = useState<number | null>(null);

  const items: Item[] = [
    {
      title: "Βίντεο Γάμου Βάπτισης",
      content:
        "Περιλαμβάνει πλήρη κάλυψη βίντεο όλων των στιγμών, επαγγελματική βιντεοσκόπηση και καλλιτεχνική, καθώς και κάλυψη όλου του στολισμού. Παραδίδεται μονταρισμένο (1 μεγάλο κλίπ με όλο το μυστήριο και ενα μικρό με τα highlights) σε USB Stick, παρουσιασμένο σε ξύλινο κουτί μαζί με εξώφυλλο.",
    },
    {
      title: "Φωτογράφηση",
      content:
        "Ανάλογα με τις ανάγκες του μυστηρίου που καλύπτουμε, μπορούμε να τραβήξουμε περίπου 500 φώτο (συνήθως σε βάπτιση) ή και πάνω απο 1000 (γάμος, κέντρο κλπ). Το μικρό πακέτο βοηθάει οικονομικά σε κάποιο πιο μικρό μυστήριο. Παραδίδεται σε USB Stick σε υψηλή ανάλυση. όλες οι φώτογραφίες επεξεργασμένες",
    },
    {
      title: "Drone",
      content:
        "Κάλυψη εναέρια απο επαγγελματικό drone, συνήθως δένει μέσα στο μοντάζ του βίντεο. Περιλαμβάνει και πλάνα απο τον χώρο, την εκκλησία και το κέντρο.",
    },
    {
      title: "Next Day",
      content:
        "Σε τοποθεσία της αρεσκείας σας ή και σε κάποια που θα σας υποδείξουμε εμείς, συνήθως το απόγευμα, περιλαμβάνει φωτογραφίες και βίντεο, μετά την ημέρα του γάμου σας, με ή χωρίς τα ρούχα του γάμου.",
    },
    {
      title: "Προετοιμασίες",
      content:
        "Στο σπίτι της νύφης και του γαμπρού, μερικές ώρες πρίν τον γάμο για να υπάρχει άνεση χρόνου, αποθανατίζουμε τις κλασικές στιγμές του ντυσίματος και των εθίμων που μπορεί να έχει η κάθε οικογένεια.",
    },
    {
      title: "Pre-Wedding",
      content:
        "Συνήθως πλαισιώνει το site (δείτε παρακάτω), το pre-wedding γίνεται για ένα πιο ανάλαφρο shooting, περιλαμβάνει φώτο και βίντεο σε χαλαρές στιγμές, συνήθως με casual ρούχα, σε τοποθεσία αντίστοιχη και μπαίνει στην αρχή του μοντάζ στην ροή της ιστορίας.",
    },
    {
      title: "Κέντρο",
      content:
        "Συνήθως 3 ώρες είναι αρκετές για να καλύψουν τις σημαντικές στιγμές (είσοδος, τούρτα, χορός) αλλά και για να έχετε στιγμιότυπα απο όταν ανάψει το γλέντι. μέχρι και τα ζεϊμπέκικα του ζευγαριού. Εάν θέλετε περισσότερη ώρα, μπορούμε να κάτσουμε και μέχρι το τέλος, κάνοντας συνεντεύξεις στους παρευρισκόμενους πρίν και μετά, με επιπλέον κόστος.",
    },
    {
      title: "Ψηφιακά Άλμπουμ",
      content:
        "Το μεγάλο συνήθως είναι για το ζευγάρι και έχει διαστάσεις 30χ60 (ανάπτυγμα). Το μικρό είναι για νονούς ή κουμπάρους και είναι διαστάσεων 20χ40 (ανάπτυγμα). Περισσότερα ψηφιακά άλμπουμ κατόπιν συνεννόησης.",
    },
    {
      title: "Site Γάμου / Βάπτισης",
      content:
        "Δημιουργούμε για εσάς έναν μήνα ή και παραπάνω πρίν τον γάμο ή την βάπτιση σας, ένα site με φωτογραφίες που μας δίνετε (ή αυτές που έχουμε τραβήξει εάν έχουμε κάνει baby shooting ή pre-wedding), στο οποίο μπορούν οι καλεσμένοι να δούν ενα countdown των ημερών που απομένουν, να αφήσουν σχόλια, να δούν φωτογραφίες και βίντεο σας, καθώς και να κάνουν RSVP για το γεγονός.",
    },
    {
      title: "Baby Shooting",
      content:
        "Συνήθως γίνεται πρίν την βάπτιση, στον χώρο του ζευγαριού και περιλαμβάνει φωτογράφηση του παιδιού με θεματικά props και πολύχρωμα background, δημιουργώντας μοναδικές φωτογραφίες που στολίζουν το βιβλίο ευχών, το site σας ή και την ίδια την βάπτιση αργότερα.",
    },
  ];

  const handleToggle = (index: number): void => {
    setOpenIndex(openIndex === index ? null : index);
  };

  // Split items into two columns
  const column1 = items.slice(0, 5);
  const column2 = items.slice(5);

  return (
    <section className="bg-[#F6F6F6] py-12">
      <div className="flex justify-center items-center gap-4 px-4 lg:px-0">
        <div className="border border-[#e9a257] h-0 w-12"></div>
        <h3 className="text-3xl text-[#e9a257]">Οι υπηρεσίες μας!</h3>
        <div className="border border-[#e9a257] h-0 w-12"></div>
      </div>
      <div className="flex flex-col md:flex-row md:gap-4 px-8">
        <div className="w-full md:w-1/2 mt-8">
          {column1.map((item, index) => (
            <ExpandableDiv
              key={index}
              title={item.title}
              content={item.content}
              isOpen={openIndex === index}
              onToggle={() => handleToggle(index)}
            />
          ))}
        </div>
        <div className="w-full md:w-1/2 md:mt-8">
          {column2.map((item, index) => (
            <ExpandableDiv
              key={index + 5}
              title={item.title}
              content={item.content}
              isOpen={openIndex === index + 5}
              onToggle={() => handleToggle(index + 5)}
            />
          ))}
        </div>
      </div>

      <div className="mt-12">
        <div className="flex justify-center items-center gap-4 px-4 lg:px-0">
          <div className="border border-[#e9a257] h-0 w-12"></div>
          <h3 className="text-3xl text-[#e9a257]">Τα πακέτα μας!</h3>
          <div className="border border-[#e9a257] h-0 w-12"></div>
        </div>

        <div className="max-w-7xl mx-auto text-center mt-6 text-gray-600 px-4">
          <p>
            Επιλέξτε τις υπηρεσίες που θέλετε και δείτε το τελικό κόστος.
            Έπειτα, πατήστε &quot;Αποστολή&quot; αφού βάλετε το όνομα, το
            τηλέφωνο και το email σας και εμείς θα επικοινωνήσουμε μαζί σας το
            συντομότερο δυνατό για να σας λύσουμε οποιαδήποτε απορία έχετε και
            να συναντηθούμε απο κοντά για να οριστικοποιήσουμε την προσφορά σας!
          </p>
          <p className="mt-4">
            Για οτιδήποτε θέλετε που δεν το βλέπετε εδώ, μην διστάσετε να μας
            καλέσετε ή να στείλετε ενα email, καθώς μπορούμε να καλύψουμε όλες
            τις ανάγκες σας! Επικοινωνήστε μαζί μας και θα βρούμε λύση για
            οτιδήποτε θέλετε διαφορετικό ή ακόμα και κάτι που δεν έχουμε στην
            λίστα μας! Ακολουθεί μια ανάλυση όλων των υπηρεσιών μας, ώστε να
            γνωρίζετε τι περιλαμβάνουν τα πακέτα και οι επιλογές σας.
          </p>
        </div>
      </div>
    </section>
  );
};
